import { DropdownItem } from '@/components'

const Dropdown = () => {
  return (
    <div>
      <h3 className='text-[1.6rem] mb-[2.1rem] md:text-[1.8rem]'>
        წესები და პირობები
      </h3>

      <div className='flex flex-col gap-3 mb-[4rem]'>
        <DropdownItem text={'როდის იწყება და რა ფორმატით გაიმართება აქცია'}>
          <li>
            აქცია დაიწყება 1 აპრილს 00:00 საათზე და დასრულდება 30 აპრილს 23:59
            საათზე.
          </li>

          <li>
            <span className='inline-block mb-3'>
              აქცია ჩატარდება სამ ეტაპად:
            </span>

            <ul className='list-disc list-inside space-y-2 ml-5 marker:!text-gray_shade_2'>
              <li>Cash Game - 1 აპრილიდან 29 აპრილის ჩათვლით.</li>
              <li>Spring Series - 13 აპრილიდან 29 აპრილის ჩათვლით.</li>
              <li>Final Stage - 30 აპრილი.</li>
            </ul>
          </li>
        </DropdownItem>

        <DropdownItem text={'როგორ მივიღო აქციაში მონაწილეობა?'}>
          <li>
            <span className='inline-block mb-3'>
              პრიზების მისაღებად გასათვალისწინებელი პირობები:
            </span>

            <ul className='list-disc space-y-2 ml-5 marker:!text-gray_shade_2 leading-7 list-outside'>
              <li className='space-y-2 mb-5'>
                აუცილებელია, რომ გამარჯვებული კამპანიაში მონაწილეობას იღებდეს
                საკუთარი პირადი ანგარიშით, წინააღმდეგ შემთხვევაში, მას პრიზი არ
                გადაეცემა.
                <ul className='list-disc list-outside space-y-2 ml-5 marker:text-gray_shade_2'>
                  <li>
                    მოქმედი საზღვარგარეთის პასპორტი, მინ. მოქმედების ვადით
                    გამგზავრებიდან 6 თვე.
                  </li>
                  <li>ნასამართლეობის ცნობა.</li>
                </ul>
              </li>

              <li>მოპოვებული საგზური ფულად პრიზში არ გადაიცვლება.</li>
              <li>
                ევროპაბეთის ანგარიშზე მითითებულ მეილზე გადაიგზავნება
                ხელშეკრულება. მოთამაშე პრიზს მხოლოდ ხელშეკრულებაზე ელექტრონული
                ხელმოწერის დაფიქსირების შემდეგ მიიღებს.
              </li>
            </ul>
          </li>

          <li>
            ვაუჩერები გამარჯვებულებს გადაეცემათ არაუგვიანეს 2023 წლის მაისის
            ბოლომდე.
          </li>

          <li>
            მისტიური გასაღების შესახებ დეტალური ინფორმაცია მოთამაშეებისთვის
            ცნობილი გახდება წლის ბოლომდე.
          </li>
        </DropdownItem>

        <DropdownItem text={'სხვადასხვა'}>
          <li className='leading-7'>
            ნებისმიერი სახის არასამართლიანი თამაში დაისჯება ევროპაბეთის წესების
            შესაბამისად და ასეთ ქმედებაში შემჩნეული მოთამაშე, კომპანიის
            გადაწყვეტილებით, მოიხსნება გათამაშებიდან და ვერ მიიღებს
            არასამართლიანად მოგებულ პრიზს.
          </li>

          <li className='leading-7'>
            ევროპაბეთი იტოვებს უფლებას ნებისმიერ დროს, ცალმხრივად შეიტანოს
            ცვლილება აქციის პირობებში. კომპანია დაუყოვნებლივ უზრუნველყოფს
            ცვლილებების გამოქვეყნებას, ხოლო მოთამაშე ვალდებულია ეტაპობრივად
            გაეცნოს www.europebet.com ვებ გვერდზე არსებულ აქციის წესებს.
          </li>
        </DropdownItem>
      </div>
    </div>
  )
}

export default Dropdown
